## 关于因果论

第1章：概率、图和因果模型导论

介绍因果关系的基本含义，如何理解因果干预与因果效应以及反事实等基本内容

第2章：推断因果关系的理论

深入介绍因果关系分析，从基本直觉出发，介绍了因果结构、因果模型、因果推断、潜在结构以及因果关系推断的局部准则等基本理论。

第3章：因果图和因果效应的识别

介绍了因果图和因果效应识别，引入do-操作，后门准则、前门准则等定义，谈论了如何通过因果假定推断因果效应。

第4章：行动、计划和直接效应

讨论行动、计划和因果直接效应评估的问题，定义了行动以及由行动延伸的计划，讨论了基于图准则在什么情况下计划的结果是可识别的，并且以招聘中性别歧视的案例，论证了直接效应所需要的假定。

第5章：社会科学和经济学中的因果关系和结构模型

描述结构方程模型问题，这一章目标在于重新表述结构方程模型的因果解释：随着图模型和干预操作的发展，结构方程如何走出当前的困境，并作为因果建模的主要语言；通过参数化和非参数化分析进行结构方程模型检验和识别的概念及应用问题。

第6章：辛普森悖论、混杂和可折叠性

讨论了因果概念中的混杂问题，从分析辛普森悖论这一有趣的故事开始，通过统计准则来定义和控制混杂时所遇到的困难和解决方案，并在这章的最后讨论了可压缩性与无混杂性、混杂因子与混杂性之间的区别等问题。

第7章：基于结构的反事实逻辑

阐述了反事实与结构模型的形式化理论，如何根据结构模型语义得出反事实和因果关系的公理化特征。

第8章：不完美的实验：效应和反事实的界限

8-10章节 继续展开了反事实分析的应用、估算因果效应、必要性原因，充分性原因、实际原因等方法的分析，并分别举例说明因果分析技术在不依从实验、法律责任以及特例事件等各种情况下的应用 。

第9章：因果概率：解释和识别

第10章：实际原因（从第48张幻灯片开始）

因果论作者网页链接：

https://bayes.cs.ucla.edu/jp_home.html
